socialNetwork/wrk2/user-timeline-without-istio/COMMAND_33/97
Running 1m test @ http://localhost:31111/wrk2-api/post/compose
  8 threads and 16 connections
  Thread calibration: mean lat.: 3942.381ms, rate sampling interval: 14155ms
  Thread calibration: mean lat.: 3871.777ms, rate sampling interval: 14106ms
  Thread calibration: mean lat.: 3899.943ms, rate sampling interval: 14106ms
  Thread calibration: mean lat.: 3907.553ms, rate sampling interval: 13983ms
  Thread calibration: mean lat.: 3903.982ms, rate sampling interval: 14090ms
  Thread calibration: mean lat.: 3909.641ms, rate sampling interval: 14032ms
  Thread calibration: mean lat.: 3887.469ms, rate sampling interval: 14090ms
  Thread calibration: mean lat.: 3892.985ms, rate sampling interval: 14082ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    16.48s     3.23s   21.82s    70.46%
    Req/Sec    22.38      1.98    26.00     91.67%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   17.32s 
 75.000%   19.01s 
 90.000%   19.86s 
 99.000%   21.82s 
 99.900%   22.38s 
 99.990%   22.46s 
 99.999%   22.51s 
100.000%   22.51s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    9043.967     0.000000            1         1.00
   11173.887     0.100000          941         1.11
   13713.407     0.200000         1876         1.25
   15204.351     0.300000         2817         1.43
   16138.239     0.400000         3756         1.67
   17317.887     0.500000         4691         2.00
   17661.951     0.550000         5187         2.22
   17973.247     0.600000         5629         2.50
   18366.463     0.650000         6102         2.86
   18726.911     0.700000         6573         3.33
   19021.823     0.750000         7071         4.00
   19136.511     0.775000         7297         4.44
   19251.199     0.800000         7517         5.00
   19365.887     0.825000         7759         5.71
   19496.959     0.850000         7995         6.67
   19644.415     0.875000         8210         8.00
   19742.719     0.887500         8335         8.89
   19857.407     0.900000         8450        10.00
   20037.631     0.912500         8560        11.43
   20234.239     0.925000         8682        13.33
   20529.151     0.937500         8799        16.00
   20643.839     0.943750         8861        17.78
   20791.295     0.950000         8913        20.00
   20955.135     0.956250         8972        22.86
   21151.743     0.962500         9031        26.67
   21250.047     0.968750         9090        32.00
   21315.583     0.971875         9121        35.56
   21364.735     0.975000         9147        40.00
   21446.655     0.978125         9174        45.71
   21594.111     0.981250         9209        53.33
   21708.799     0.984375         9238        64.00
   21741.567     0.985938         9256        71.11
   21757.951     0.987500         9262        80.00
   21807.103     0.989062         9280        91.43
   21839.871     0.990625         9292       106.67
   21905.407     0.992188         9309       128.00
   21921.791     0.992969         9314       142.22
   21954.559     0.993750         9322       160.00
   21970.943     0.994531         9328       182.86
   22052.863     0.995313         9336       213.33
   22167.551     0.996094         9344       256.00
   22183.935     0.996484         9347       284.44
   22216.703     0.996875         9352       320.00
   22233.087     0.997266         9355       365.71
   22249.471     0.997656         9358       426.67
   22265.855     0.998047         9361       512.00
   22298.623     0.998242         9363       568.89
   22331.391     0.998437         9367       640.00
   22331.391     0.998633         9367       731.43
   22364.159     0.998828         9369       853.33
   22380.543     0.999023         9373      1024.00
   22380.543     0.999121         9373      1137.78
   22380.543     0.999219         9373      1280.00
   22380.543     0.999316         9373      1462.86
   22396.927     0.999414         9374      1706.67
   22413.311     0.999512         9375      2048.00
   22413.311     0.999561         9375      2275.56
   22429.695     0.999609         9376      2560.00
   22429.695     0.999658         9376      2925.71
   22462.463     0.999707         9378      3413.33
   22462.463     0.999756         9378      4096.00
   22462.463     0.999780         9378      4551.11
   22462.463     0.999805         9378      5120.00
   22462.463     0.999829         9378      5851.43
   22462.463     0.999854         9378      6826.67
   22462.463     0.999878         9378      8192.00
   22462.463     0.999890         9378      9102.22
   22511.615     0.999902         9379     10240.00
   22511.615     1.000000         9379          inf
#[Mean    =    16482.805, StdDeviation   =     3231.245]
#[Max     =    22495.232, Total count    =         9379]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  12454 requests in 1.00m, 2.55MB read
  Socket errors: connect 0, read 0, write 0, timeout 151
Requests/sec:    207.52
Transfer/sec:     43.57KB